app/Controllers/Admin/Laporan.php

    public function index()
    {
        if (!$this->isSecure()) return redirect()->to(site_url('/admin/login'))->with('msg', [0, 'Sesi anda telah kadaluarsa.']);

        $record = $this->pribadi->table('tbl_dt_pribadi');

        if (@$_GET['angkatan']) {
            $record = $record->where('tbl_dt_pribadi.id_angkatan', $_GET['angkatan']);
        }

        if (@$_GET['status'] == 1) {
            $record = $record->where('tbl_nilai.rata >', $this->cfg->_nilaiminim);
        } else if (@$_GET['status'] == 2) {
            $record = $record->where('tbl_nilai.rata <', $this->cfg->_nilaiminim);
        }

        $record = $record->where('tbl_dt_pribadi.deleted_at', null);

        $record = $record->join('tbl_angkatan', 'tbl_angkatan.id_angkatan = tbl_dt_pribadi.id_angkatan')
            ->join('tbl_nilai', 'tbl_nilai.id_dt_pribadi = tbl_dt_pribadi.id', 'left')
            ->orderby('tbl_nilai.rata', 'DESC')
            ->get()
            ->getResultArray();

        $data = [
            "record" => $record,
            "angkatans" => $this->angkatan->find_active(),
            "judul" => "Laporan"
        ];
---
SELECT *
FROM `tbl_dt_pribadi`
JOIN `tbl_angkatan` ON `tbl_angkatan`.`id_angkatan` = `tbl_dt_pribadi`.`id_angkatan`
LEFT JOIN `tbl_nilai` ON `tbl_nilai`.`id_dt_pribadi` = `tbl_dt_pribadi`.`id`
WHERE `tbl_nilai`.`rata` < 75
AND `tbl_dt_pribadi`.`deleted_at` IS NULL
ORDER BY `tbl_nilai`.`rata` DESC
SELECT *
FROM `tbl_dt_pribadi`
JOIN `tbl_angkatan` ON `tbl_angkatan`.`id_angkatan` = `tbl_dt_pribadi`.`id_angkatan`
JOIN `tbl_nilai` ON `tbl_nilai`.`id_dt_pribadi` = `tbl_dt_pribadi`.`id`