app/Controllers/Admin/Pendaftar.php

  public function detail($id)
  {
    if (!$this->isSecure()) return redirect()->to(site_url('/admin/login'))->with('msg', [0, 'Sesi anda telah kadaluarsa.']);

    $data = [
      "record" => $this->pribadi->find($id),
      "nilai" => $this->nilai->find($id),
      "judul" => "Halaman Detail Pendaftar"
    ];
---
SELECT *
FROM `tbl_nilai`
WHERE `tbl_nilai`.`id_nilai` = '4'

  public function cetak($id)
  {
    if (!$this->isSecure()) return redirect()->to(site_url('/admin/login'))->with('msg', [0, 'Sesi anda telah kadaluarsa.']);

    $data = [
      "pribadi" => $this->pribadi->find($id),
      "nilai" => $this->nilai->find($id),
      "judul" => "Cetak Pendaftaran"
    ];
---
SELECT *
FROM `tbl_nilai`
WHERE `tbl_nilai`.`id_nilai` = '5'

  public function updstatusberkas(string $id, string $kode)
  {
    // Cek hak akses user
    if (!$this->isSecure()) {
      $msg = [
        'status' => false,
        'url' => site_url("admin/pendaftaran"),
        'pesan'   => 'Anda tidak berhak mengakses halaman ini',
      ];
      return json_encode($msg);
    }

    if ($kode == 1) {
      $data['status'] = "Terverifikasi";
    } else {
      $data['status'] = "Ditolak";
    }

    $get = $this->berkas->find($id);

    $lastId = $this->berkas->update(['id_berkas' => $id], $data);
---
UPDATE `tbl_berkas` SET `status` = 'Terverifikasi'
WHERE `tbl_berkas`.`id_berkas` IN ('5')