app/Controllers/Pendaftar.php

SELECT *
FROM `tbl_berkas`
WHERE `tbl_berkas`.`id_berkas` = '7'
---
  public function hapusberkas(string $id)
  {
    // Cek hak akses user
    if (!$this->isSecure('user')) {
      $msg = [
        'status' => false,
        'url' => site_url("login"),
        'pesan'   => 'Anda tidak berhak mengakses fitur ini',
      ];
      return json_encode($msg);
    }

    $hapus = $this->berkas->where('id_berkas', $id)->set(['file' => null])->update();