app/Models/AngkatanModel.php

	public function isActive()
	{
		return $this->db->table($this->table)
										->where('status', '1')
										->limit(1)
										->get()
										->getRow();
---
SELECT *
FROM `tbl_angkatan`
WHERE `status` = '1'
 LIMIT 1