app/Models/AngkatanModel.php

	public function find_active()
	{
		return $this->db->table($this->table)
			->where('isDelete', null)
			->get()
			->getResultArray();
---
SELECT *
FROM `tbl_angkatan`
WHERE `isDelete` IS NULL

	public function isActive()
	{
		return $this->db->table($this->table)
			->where('status', '1')
			->where('isDelete', null)
			->orderby('tahun', 'DESC')
			->limit(1)
			->get()
			->getRow();
---
SELECT *
FROM `tbl_angkatan`
WHERE `status` = '1'
AND `isDelete` IS NULL
ORDER BY `tahun` DESC
 LIMIT 1