app/Models/BerkasModel.php

	public function getByUser(string $id)
	{
		return $this->db->table($this->table)
			->where('id_dt_pribadi', $id)
			->get()
			->getResult();
---
SELECT *
FROM `tbl_berkas`
WHERE `id_dt_pribadi` = '5'