app/Models/NilaiModel.php

SELECT *
FROM `tbl_nilai`
WHERE `id_dt_pribadi` = '3'
 LIMIT 1
---
	public function getBySiswa(string $param)
	{
		return $this->db->table($this->table)
			->where('id_dt_pribadi', $param)
			->limit(1)
			->get()
			->getResult('array');