app/Models/PribadiModel.php

	public function find_tercabut()
	{
		$angkatan = new AngkatanModel();
		$angkatanAktif = $angkatan->isActive()->id_angkatan;
		return $this->db->table($this->table)
			->where('tbl_dt_pribadi.id_angkatan', $angkatanAktif)
			->where('tbl_dt_pribadi.deleted_at is not null')
			->join('tbl_angkatan', 'tbl_angkatan.id_angkatan = tbl_dt_pribadi.id_angkatan')
			->join('tbl_nilai', 'tbl_nilai.id_dt_pribadi = tbl_dt_pribadi.id', 'left')
			->get()
			->getResultArray();
---
SELECT *
FROM `tbl_dt_pribadi`
JOIN `tbl_angkatan` ON `tbl_angkatan`.`id_angkatan` = `tbl_dt_pribadi`.`id_angkatan`
LEFT JOIN `tbl_nilai` ON `tbl_nilai`.`id_dt_pribadi` = `tbl_dt_pribadi`.`id`
WHERE `tbl_dt_pribadi`.`id_angkatan` = '3'
AND `tbl_dt_pribadi`.`deleted_at` is not null